In [2]:
import pandas as pd
import numpy as np
from random import randint

In [38]:
# 1. Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe. 
ser=pd.Series(np.random.randint(0,5,5),index=pd.date_range('1-1-2019',periods=5,freq='D'))
ser

2019-01-01    4
2019-01-02    0
2019-01-03    3
2019-01-04    2
2019-01-05    2
Freq: D, dtype: int32

In [3]:
# 2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . 
# Create a dataframe with height and weight as column names. 

data={'Height':[23,42,55],'Weight':[71,32,48]}
df=pd.DataFrame(data)
print(df)

   Height  Weight
0      23      71
1      42      32
2      55      48

In [4]:
# 3. How to get the items of series A not present in series B .From ser1 remove items present in ser2.
ser1=pd.Series([2,3,4,5])
ser2=pd.Series([5,6,7,8])
print("Series 1:\n")
print(ser1)
print("Series 2:\n")
print(ser2)
res=ser1[~ser1.isin(ser2)]
print(res)

Series 1:

0    2
1    3
2    4
3    5
dtype: int64
Series 2:

0    5
1    6
2    7
3    8
dtype: int64
0    2
1    3
2    4
dtype: int64

In [5]:
# Questions on Titanic Dataset :

In [6]:
df=pd.read_csv(r'C:\Datascience datasets\titanic_test.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
# 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [8]:
# Shape of the dataframe
df.shape

(418, 11)

In [9]:
# Description of dataframe
df.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [10]:
# We see: min=17 months; mean=30 years; Q1=21 years;Q2=27 yrs;Q3=39 yrs; max=76 yrs.
# Thus we note that most of the passengers are between 21 to 39 years

In [11]:
# 5. How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset
df['SibSp'].value_counts()

0    283
1    110
2     14
4      4
3      4
8      2
5      1
Name: SibSp, dtype: int64

In [12]:
# 6. Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ 
# column of titanic dataset
print("Top 2 frequencies")
df.Embarked.value_counts()

Top 2 frequencies

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [13]:
info_freq=90
info=dict(zip(*np.unique(df.Embarked,return_counts=True)))
df.Embarked=df.Embarked.apply(lambda x:'Other' if info[x]<info_freq else x)
df.Embarked.value_counts()

S        270
C        102
Other     46
Name: Embarked, dtype: int64

In [14]:
# 7.  Bin the price column in titanic data set into 5 equal groups and get counts of each bin
df['Fare']=pd.qcut(df['Fare'],q=5)
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,"(7.796, 11.025]",NaN,Other
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,"(-0.001, 7.796]",NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,"(7.796, 11.025]",NaN,Other
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,"(7.796, 11.025]",NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,"(11.025, 21.438]",NaN,S

In [15]:
print("Counting each bin")
df['Fare'].value_counts()

Counting each bin

(-0.001, 7.796]     85
(46.62, 512.329]    84
(21.438, 46.62]     83
(11.025, 21.438]    83
(7.796, 11.025]     82
Name: Fare, dtype: int64

In [16]:
# 8. Count the number of missing values in each column
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [17]:
# 9. Get the row number of the 5th largest value in the Age column of titanic dataset?
print(" 5th largest values is")
df.Age.nlargest(5).iloc[4]

 5th largest values is

64.0

In [18]:
df.Age.nlargest(5).idxmax()

96

In [19]:
df.loc[96]

PassengerId                                                  988
Pclass                                                         1
Name           Cavendish, Mrs. Tyrell William (Julia Florence...
Sex                                                       female
Age                                                           76
SibSp                                                          1
Parch                                                          0
Ticket                                                     19877
Fare                                            (46.62, 512.329]
Cabin                                                        C46
Embarked                                                       S
Name: 96, dtype: object

In [20]:
#10. Normalize all columns in a dataframe?
# By default all columns in pandas datframe are normalized

In [21]:
# 11. Get the indices of items of ser2 in ser1 as a list.
ser1=pd.Series([10,9,6,5,3,1,12,8,13])
ser2=pd.Series([1,3,10,13])
result=ser1[ser1.isin(ser2)].index
print(result)

Int64Index([0, 4, 5, 8], dtype='int64')

In [22]:
# 12. How to convert a series of date-strings to a timeseries?
ser=pd.Series(['01Jan2010','02-02-2011','20120303','2013/04/04','2014-05-05',
                        '2015-06-06T12:20'])
ser1=pd.to_datetime(ser)
print(ser1)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [23]:
# 13. Get the day of month, week number, day of year and day of week from ser.
from dateutil.parser import parse
ser=pd.Series(['01Jan2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
print("Original Series: \n",ser)
ser1=ser.map(lambda x: parse(x))
print(" Day of month:\n",ser1.dt.day.tolist())
print(" Week number:\n",ser1.dt.week.tolist())
print(" Day of year:\n",ser1.dt.dayofyear.tolist())
print(" Day of week:\n",ser1.dt.dayofweek.tolist())

Original Series:
 0           01Jan2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object
 Day of month:
 [1, 2, 3, 4, 5, 6]
 Week number:
 [53, 5, 9, 14, 19, 23]
 Day of year:
 [1, 33, 63, 94, 125, 157]
 Day of week:
 [4, 2, 5, 3, 0, 5]

In [25]:
# 14. Compute the euclidean distance between series (points) p and q, without using a packaged formula.
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
result=sum((p-q)**2)**0.5
result

18.16590212458495

In [26]:
# 15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)
import pandas as pd
from random import randint
ser=pd.Series(np.random.randint(1,10,10),pd.date_range('2000-01-01',periods=10,freq='W-SAT'))# W-SAT means weekly saturdays
ser

2000-01-01    9
2000-01-08    9
2000-01-15    4
2000-01-22    2
2000-01-29    2
2000-02-05    1
2000-02-12    3
2000-02-19    6
2000-02-26    7
2000-03-04    4
Freq: W-SAT, dtype: int32

In [30]:
# 16  Import every 50th row of BostonHousing dataset as a dataframe.
boston_df=pd.read_csv(r'C:\Datascience datasets\boston_house_price.csv')
boston_df.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [36]:
house50=pd.DataFrame(boston_df.iloc[::50,:])
house50.T

,0,50,100,150,200,250,300,350,400,450,500
CRIM,0.00632,0.08873,0.14866,1.6566,0.01778,0.1403,0.04417,0.06211,25.0461,6.71772,0.22438
ZN,18.00000,21.00000,0.00000,0.0000,95.00000,22.0000,70.00000,40.00000,0.0000,0.00000,0.00000
INDUS,2.31000,5.64000,8.56000,19.5800,1.47000,5.8600,2.24000,1.25000,18.1000,18.10000,9.69000
CHAS,0.00000,0.00000,0.00000,0.0000,0.00000,0.0000,0.00000,0.00000,0.0000,0.00000,0.00000
NOX,0.53800,0.43900,0.52000,0.8710,0.40300,0.4310,0.40000,0.42900,0.6930,0.71300,0.58500
RM,6.57500,5.96300,6.72700,6.1220,7.13500,6.4870,6.87100,6.49000,5.9870,6.74900,6.02700
AGE,65.20000,45.70000,79.90000,97.3000,13.90000,13.0000,47.40000,44.40000,100.0000,92.60000,79.70000
DIS,4.09000,6.81470,2.77780,1.6180,7.65340,7.3967,7.82780,8.79210,1.5888,2.32360,2.49820
RAD,1.00000,4.00000,5.00000,5.0000,3.00000,7.0000,5.00000,1.00000,24.0000,24.00000,6.00000
TAX,296.00000,243.00000,384.00000,403.0000,402.00000,330.0000,358.00000,335.00000,666.0000,666.00000,391.00000
PTRATIO,15.30000,16.80000,20.90000,14.7000,17.00000,19.1000,14.80000,19.70000,20.2000,20.20000,19.20000
B,396.90000,395.56000,394.76000,372.8000,384.30000,396.2800,390.86000,396.90000,396.9000,0.32000,396.90000
LSTAT,4.98000,13.45000,9.42000,14.1000,4.45000,5.9000,6.07000,5.98000,26.7700,17.44000,14.33000
MEDV,24.00000,19.70000,27.50000,21.5000,32.90000,24.4000,24.80000,22.90000,5.6000,13.40000,16.80000